//! Примитивы базы данных и структуры данных.
//!
//! Этот модуль предоставляет основные типы данных и абстракции
//! для реализации базы данных в оперативной памяти:
//!
//! - `dict`: обобщённая хеш-таблица «ключ-значение» с поддержкой пользовательских типов ключей.
//! - `int_set`: компактное множество для эффективного хранения целых чисел.
//! - `list_pack`: компактный формат сериализации для хранения небольших списков элементов.
//! - `lua`: поддержка выполнения встроенных Lua-скриптов.
//! - `quicklist`: эффективный по памяти двусвязный список с поддержкой сжатия.
//! - `sds`: простой динамический строковый тип, оптимизированный по производительности.
//! - `skip_list`: отсортированная структура данных с логарифмической сложностью операций.
//! - `smart_hash`: гибридная хеш-таблица, оптимизированная по памяти и скорости.
//! - `types`: определения поддерживаемых типов значений в базе данных.

pub mod aof;
pub mod cluster;
pub mod memory;
pub mod persistent;
pub mod storage;
pub mod store;
pub mod zdb;
pub mod zdb_protocol;

pub use aof::*;
pub use cluster::*;
pub use memory::*;
pub use persistent::*;
pub use storage::*;
pub use store::*;
pub use zdb::*;
pub use zdb_protocol::*;
